images/carritogestionweb/1713973627.0485_results_AutRequest_soap.txt

SoapClient::__set_state(array(
   'trace' => 1,
   '_exceptions' => false,
   '_encoding' => 'UTF-8',
   '_stream_context' => NULL,
   '_soap_version' => 1,
   'sdl' => NULL,
   '__last_request' => '<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://ar.gov.afip.dif.FEV1/"><SOAP-ENV:Body><ns1:FECAESolicitar><ns1:Auth><ns1:Token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhLCBPPUFGSVAsIEM9QVIsIFNFUklBTE5VTUJFUj1DVUlUIDMzNjkzNDUwMjM5IiBkc3Q9IkNOPXdzZmUsIE89QUZJUCwgQz1BUiIgdW5pcXVlX2lkPSIyMDg4NTQxMzE3IiBnZW5fdGltZT0iMTcxMzk3MzU2NiIgZXhwX3RpbWU9IjE3MTQwMTY4MjYiLz4KICAgIDxvcGVyYXRpb24gdHlwZT0ibG9naW4iIHZhbHVlPSJncmFudGVkIj4KICAgICAgICA8bG9naW4gZW50aXR5PSIzMzY5MzQ1MDIzOSIgc2VydmljZT0id3NmZSIgdWlkPSJTRVJJQUxOVU1CRVI9Q1VJVCAyMDMwNzAwOTcxNSwgQ049Z2VzdGlvbnN0YWZpcCIgYXV0aG1ldGhvZD0iY21zIiByZWdtZXRob2Q9IjIyIj4KICAgICAgICAgICAgPHJlbGF0aW9ucz4KICAgICAgICAgICAgICAgIDxyZWxhdGlvbiBrZXk9IjIwMzA3MDA5NzE1IiByZWx0eXBlPSI0Ii8+CiAgICAgICAgICAgIDwvcmVsYXRpb25zPgogICAgICAgIDwvbG9naW4+CiAgICA8L29wZXJhdGlvbj4KPC9zc28+Cg==</ns1:Token><ns1:Sign>TGblmnQN6n2Msi/A5defZBmJay0HeawzYi6CLyZejqxb9N8MtL/v5ZJts0W5M10ot0IhzHB6kQ7ORopaVo6y6uf01RaKzd2RApHj35N5K3hypf7JDrQ5CBnkud5mGoQKbj5Yl0m8uPuFD2Pl2aX/QOZBLHXxPEuAS6gM78ClEFo=</ns1:Sign><ns1:Cuit>20307009715</ns1:Cuit></ns1:Auth><ns1:FeCAEReq><ns1:FeCabReq><ns1:CantReg>1</ns1:CantReg><ns1:PtoVta>3</ns1:PtoVta><ns1:CbteTipo>11</ns1:CbteTipo></ns1:FeCabReq><ns1:FeDetReq><ns1:FECAEDetRequest><ns1:Concepto>1</ns1:Concepto><ns1:DocTipo>96</ns1:DocTipo><ns1:DocNro>99999999</ns1:DocNro><ns1:CbteDesde>3</ns1:CbteDesde><ns1:CbteHasta>3</ns1:CbteHasta><ns1:CbteFch>20240424</ns1:CbteFch><ns1:ImpTotal>10</ns1:ImpTotal><ns1:ImpTotConc>0</ns1:ImpTotConc><ns1:ImpNeto>10</ns1:ImpNeto><ns1:ImpOpEx>0</ns1:ImpOpEx><ns1:ImpTrib>0</ns1:ImpTrib><ns1:ImpIVA>0</ns1:ImpIVA><ns1:FchServDesde></ns1:FchServDesde><ns1:FchServHasta></ns1:FchServHasta><ns1:FchVtoPago></ns1:FchVtoPago><ns1:MonId>PES</ns1:MonId><ns1:MonCotiz>1</ns1:MonCotiz></ns1:FECAEDetRequest></ns1:FeDetReq></ns1:FeCAEReq></ns1:FECAESolicitar></SOAP-ENV:Body></SOAP-ENV:Envelope>
',
   'httpsocket' => NULL,
   '_use_proxy' => 0,
   'httpurl' => NULL,
   '__last_request_headers' => 'POST /wsfev1/service.asmx HTTP/1.1
Host: servicios1.afip.gov.ar
Connection: Keep-Alive
User-Agent: PHP-SOAP/5.5.37
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://ar.gov.afip.dif.FEV1/FECAESolicitar"
Content-Length: 2029

',
   '__last_response_headers' => 'HTTP/1.1 200 OK
Date: Wed, 24 Apr 2024 15:47:07 GMT
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Content-Length: 1192
Set-Cookie: f5avraaaaaaaaaaaaaaaa_session_=BGGAPIHOLIFIFILFDINHMPAHCBOKKEGBOHKPMNOLPHLBAEBKAIEHOKKMHJEPMPBPJHKDGGBBPJAFIPALHPCAOOOBCCJMKAJHMDMIBLDACOBCCDPKKAJJLEGDOKCKKDNI; HttpOnly; secure
Set-Cookie: TS0122d503=0145b27a972cbcb39f27aefd305cac3c89a6828fd2984ad36d6083de6d948f09a3240655730483b128a302a53fd863a8e051da50e0; Path=/
',
   '_cookies' => 
  array (
    'f5avraaaaaaaaaaaaaaaa_session_' => 
    array (
      0 => 'BGGAPIHOLIFIFILFDINHMPAHCBOKKEGBOHKPMNOLPHLBAEBKAIEHOKKMHJEPMPBPJHKDGGBBPJAFIPALHPCAOOOBCCJMKAJHMDMIBLDACOBCCDPKKAJJLEGDOKCKKDNI',
      3 => true,
      1 => '/wsfev1',
      2 => 'servicios1.afip.gov.ar',
    ),
    'TS0122d503' => 
    array (
      0 => '0145b27a972cbcb39f27aefd305cac3c89a6828fd2984ad36d6083de6d948f09a3240655730483b128a302a53fd863a8e051da50e0',
      1 => '/wsfev1',
      2 => 'servicios1.afip.gov.ar',
    ),
  ),
   '__last_response' => '<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><FEHeaderInfo xmlns="http://ar.gov.afip.dif.FEV1/"><ambiente>Produccion - Se6</ambiente><fecha>2024-04-24T12:47:07.0177381-03:00</fecha><id>5.5.0.0</id></FEHeaderInfo></soap:Header><soap:Body><FECAESolicitarResponse xmlns="http://ar.gov.afip.dif.FEV1/"><FECAESolicitarResult><FeCabResp><Cuit>20307009715</Cuit><PtoVta>3</PtoVta><CbteTipo>11</CbteTipo><FchProceso>20240424124706</FchProceso><CantReg>1</CantReg><Resultado>R</Resultado><Reproceso>N</Reproceso></FeCabResp><FeDetResp><FECAEDetResponse><Concepto>1</Concepto><DocTipo>96</DocTipo><DocNro>99999999</DocNro><CbteDesde>3</CbteDesde><CbteHasta>3</CbteHasta><CbteFch>20240424</CbteFch><Resultado>R</Resultado><CAE /><CAEFchVto /></FECAEDetResponse></FeDetResp><Errors><Err><Code>10016</Code><Msg>El numero o fecha del comprobante no se corresponde con el proximo a autorizar. Consultar metodo FECompUltimoAutorizado.</Msg></Err></Errors></FECAESolicitarResult></FECAESolicitarResponse></soap:Body></soap:Envelope>
',
))